import "./styles.scss";
import { Urls } from "../urls";
import { FourBanner } from "../../components/footer/components/fourBanner";

export const CorpoarteClients = () => {
  const breadcrumbs = [
    {
      id: 1,
      name: "Գլխավոր էջ",
      path: "/",
      img: "https://supermarket.am/images/bread_right.svg",
    },
    {
      id: 2,
      name: "Կորպորատիվ հաճախորդներին",
      path: "/corporateclients",
    },
  ];

  return (
    <>
      <div className="corporate-clients-section">
        <div className="corporate-clients-page">
          <Urls data={breadcrumbs} />
          <div className="corporate-clients">
            <h1 className="corporate-clients-title">
              Կորպորատիվ հաճախորդներին
            </h1>
            <p className="corporate-clients-text-titles">
              Կորպորատիվ հաճախորդների առավելություններն են՝
            </p>

            <div className="corporate-clients-text">
              <li>1. Անվճար առաքման ծառայություն</li>
              <li>
                2. 500 000 դր և ավել գնումների դեպքում 10 000 դրամի համարժեք
                նվերներ՝ առկա տեսականուց
              </li>
              <li>
                3. 1.000.000 դր և ավել գնումների դեպքում 20 000 դրամի համարժեք
                նվերներ՝ առկա տեսականուց
              </li>
              <li>
                4. Անվճար առաքում դեպի Ծաղկաձոր՝ 100 000 դր և ավել գնումների
                դեպքում
              </li>
            </div>

            <p className="corporate-clients-text-titles">
              Օնլայն սուպերմարկետն առաջարկում է հատուկ պայմաններ իրավաբանական
              անձանց համար՝
            </p>

            <div className="corporate-clients-text">
              <li>
                1. Կորպորատիվ հաճախորդների սպասարկմամբ զբաղվում է կորպորատիվ
                վաճառքների մենեջերը, ով իրականացնում է պատվերների պատշաճ
                կազմակերպումը և հաճախորդների համակողմանի խորհրդատվությունը:
              </li>
              <li>
                2. Պայմանագրի առկայության դեպքում վճարումն իրականացվում է
                բանկային փոխանցման եղանակով: Հաշիվ-ապրանքագիրը ըստ հաճախորդի
                ցանկության ներկայացվում է ամսվա վերջում կամ յուրաքանչյուր
                պատվերից հետո: Այս դեպքում ընկերությունները և այլ
                հաստատությունները ստիպված չեն լինում կանխիկացնել իրենց գումարը:
              </li>
              <li>
                3. Առաքումը Երևանում իրականացվում է անվճար` անկախ պատվերի
                ծավալից: Դուք ազատվում եք լրացուցիչ ծախսերից և ժամանակի
                վատնումից, հատկապես` եթե խոսքը գնում է մեծ գնումների մասին:
              </li>
            </div>

            <p className="corporate-clients-text-titles">
              Օնլայն գնումներն ունեն մի շարք առավելություններ, որոնցից
              կազմակերպությունների համար կարելի է առանձնացնել հետևյալները.
            </p>

            <div className="corporate-clients-text">
              <li>
                1. Ապրանքները կարելի է գտնել շատ արագ` շնորհիվ որոնման
                ընդլայնված համակարգի, ապրանքների` ըստ ենթաբաժինների գրագետ
                բաշխման և տարբեր պարամետրերով տեսակավորելու հնարավորության:
              </li>
              <li>
                2. Պատվերը կարելի է տալ ոչ թե մոտավոր, այլ հստակ` նախապես
                դիտելով տվյալ ապրանքի անվանումը, գինը, լուսանկարը,
                նկարագրությունը, ինչպես նաև համեմատելով այլ նմանատիպ ապրանքների
                հետ:
              </li>
              <li>
                3. Եթե ցանկանում եք կատարել կորպորատիվ պատվերներ, պետք է
                պարզապես վճարման տարբերակը նշել՝ բանկային փոխանցում:
              </li>
              <li>
                4. Կարող եք ստեղծել նախընտրած ապրանքների ցուցակ, որը միշտ
                կպահպանվի և կօգնի Ձեզ հաշված վայրկյանների ընթացքում գտնել ու
                պատվիրել այս կամ այն ապրանքը:
              </li>
              <li>
                5. Ցանկացած պահի կարող եք դիտել Ձեր նախորդ պատվերները և
                անհրաժեշտության դեպքում ընդամենը մի քանի րոպեում կրկնել դրանցից
                յուրաքանչյուրը` ավելացնելով կամ հեռացնելով այս կամ այն ապրանքը:
              </li>
              <li>6. Պատվերը կարելի է տալ նախապես` նշելով հստակ ժամ և վայր:</li>
            </div>

            <div className="corporate-clients-footer-text">
              Եթե հետաքրքրված եք, կարող եք թողնել Ձեր տվյալները` գրելով
              info@supermarket.am էլ փոստին: Ձեզ հետաքրքրող հարցերի և պայմանագրի
              կնքման համար կարող եք զանգահարել կորպորատիվ վաճառքների
              մենեջերին`+374 33 533 555 հեռախոսահամարով:
            </div>
          </div>
        </div>
      </div>

      <FourBanner />
    </>
  );
};
