import { TopNav } from "../topnav";
import "./styles.scss";

import { Urls } from "../urls";

export const DeliveryPayment = () => {
  
  const breadcrumbs = [
    {
      id: 1, 
      name: "Գլխավոր էջ",
      path: "/",
      img: "https://supermarket.am/images/bread_right.svg"
    },
    {
      id: 2,
      name: "Առաքում և վճարում",
      path: "/deliveryPayment"
    }
  ]

  return (
    <div className="delivery-payment-page">
      <TopNav />

      <Urls data={breadcrumbs} />

      <div className="delivery-page">
        <h1>Առաքում և վճարում</h1>

        <div className="static-page">
          <p className="title">
            <span>Առաքում</span>
          </p>

          <p className="delivery1">
            <span>1. Առաքում և վճարում</span>
          </p>

          <p className="delivery1-1">
            1.1 Պատվերներն ընդունվում են առցանց՝ supermarket.am կայքի միջոցով
            կամ 011555555 հեռախոսահամարի միջոցով (սպասարկման որակը բարելավելու
            նպատակով, ինչպես նաև հետագա հնարավոր խնդիրները կարգավորելու նպատակով
            զանգը կարող է ձայնագրվել, որի վերաբերյալ օգտվելով մեր
            ծառայություններից դուք տալիս եք ձեր համաձայնությունը):
          </p>

          <p>
            1.2. Supermarket.am կայքում Դուք ընտրում եք Ձեր նախընտրած ապրանքը,
            նշում հասցեն, ուր պետք է առաքվի այն, հեռախոսահամարը, նախընտրելի
            ժամանակահատվածը` օրը և ժամը, ինչպես նաև տալիս հավելյալ
            տեղեկություններ, եթե դրա անհրաժեշտությունը կա: Ունենալով Ձեր ֆիքսված
            և/կամ բջջային հեռախոսահամարները` մեր առաքիչը կարող է կապ հաստատել
            Ձեզ հետ և ճշտումներ կատարել: Անհրաժեշտության դեպքում դուք կարող եք
            լրացնել առցանց կատարված պատվերը՝ կապվելով մեր զանգերի կենտրոն և
            խնդրել օպերատորին ավելացնել անհրաժեշտ ապրանքը Ձեր պատվերին:
          </p>

          <p className="title2 delivery-titles">
            <span>2. ԱՌԱՔՄԱՆ ԿԱՐԳ</span>
          </p>

          <p>
            2.1.Մինչև 10000 դր գնումների դեպքում առաքման արժեքը 500 դր է, իսկ
            10.000 դրամ և ավելի գնումների դեպքում առաքումը կլինի անվճար: Առաքման
            ժամկետը պարբերաբար փոփոխվում է կախված պատվերների քանակից և այլ
            պայմաններից: Առաքման համար նշված ժամկետը կարող է տարբերվել փաստացի
            առաքման ժամից:
          </p>

          <p className="title3 delivery-titles">
            <span>3. Պատվերի կարգավիճակը և պատմությունը</span>
          </p>

          <p>
            3.1.Կայք մուտք գործելուց հետո Դուք հնարավորություն եք ունենում Ձեր
            անձնական էջում հետևելու պատվերների պատմությանը և տեսնել կատարված
            պատվերի ամսաթիվը, կարգավիճակը («Հանձնված է հավաքման», «Առաքումը
            սկսված է», «Ամբողջությամբ առաքված է» և այլն), ինչպես նաև զամբյուղի
            արժեքը:
          </p>

          <p className="title4 delivery-titles">
            <span>4. Վճարման եղանակները</span>
          </p>

          <p>
            4.1. Supermarket.am-ում պատվերի համար վճարումն իրականացվում է մի
            քանի եղանակով:
          </p>

          <p>
            4.2.Online վճարում: Մեր կայքում online վճարումներն իրականացվում են
            Master, Visa, Arca, IDram, Telcell վճարային համակարգերի միջոցով: Եթե
            արդեն գրանցված եք այդ համակարգերում, ապա համապատասխան տարբերակն
            ընտրելուց և պատվերը հաստատելուց հետո կհայտնվեք տվյալ վճարային
            համակարգի կայքում, որտեղ անհրաժեշտ է մուտքագրել այդ համակարգում Ձեր
            օգտանունն ու գաղտնաբառը և կատարել վճարումը:
          </p>

          <p>
            4.3.Կանխիկ: Սա նշանակում է, որ Դուք Ձեր պատվիրած ապրանքի և դրա
            առաքման դիմաց վճարում եք պատվերը ստանալիս` կանխիկ գումարով: Կայքի
            համապատասխան էջում այս տարբերակն ընտրելուց հետո Դուք նաև նշում եք`
            արդյոք անհրաժեշտ է բերել մանր:Առաքիչը տրամադրում է Ձեր ՀԴՄ կտրոնը:
            Եթե որևէ պատճառով Ձեզ չի տրամադրվել ՀԴՄ կտրոն, անհրաժեշտ է այդ մասին
            անհապաղ տեղեկացնել մեզ:
          </p>

          <p>
            4.4.Վճարային քարտով` պատվերը ստանալու ժամանակ: Այս տարբերակն
            ընտրելու դեպքում մեր առաքիչն իր հետ կբերի POS տերմինալ, և դուք
            կկարողանաք Ձեր քարտով վճարումն իրականացնել հենց տեղում և ստանալ
            համապատասխան կտրոնը:
          </p>

          <p>
            4.5.Քարտով ցանկացած վճարում կատարելիս դուք հաստատում եք, որ
            հանդիսանում եք քարտի օրինական օգտագործող /քարտի սեփականատեր, այլ
            լիազորված օգտատեր/ և առկա են բոլոր իրավասությունները գործարք
            կատարելու համար: Կայքում գրանցված հաշվետերը և քարտապանը համապարտ
            պատասխանատվություն են կրում ընկերության հանդեպ առկա բոլոր դրամական
            պարտավորությունների համար: Ընկերության պահանջով՝ կախված պատվերի
            տեսակից և գումարի մեծությունից, կարող են պահանջվել այլ լրացուցիչ
            երաշխիքներ առաքումն իրականացնելուց առաջ, եթե վճարում կատարող
            քարտապանը և/կամ գրանցված օգտատերը չեն նույնացվում կամ դրանք տարբեր
            անձինք են:
          </p>

          <p className="title5 delivery-titles">
            <span>5. Կանխիկ վճարման պայմանները</span>
          </p>

          <p>
            5.1.Կանխիկ վճարումն իրականացվում է պատվերը ստանալու պահին: Մեր
            առաքչին իրավունք է վերապահվում հետ վերադարձնել առաքված ապրանքը, եթե
            պատվիրատուն առաջարկում է դրա դիմաց վճարել հետագայում:
          </p>

          <p>
            5.2.Դոլարով կամ այլ արտարժույթով կանխիկ վճարումները չեն ընդունվում,
            քանի որ դրանք հակասում են ՀՀ օրենսդրությանը:
          </p>

          <p>
            5.3.Կայքում ներկայացված ապրանքների գները վերջնական են և ներառում են
            բոլոր հարկերը: Գները կարող են միակողմանի փոփոխվել ընկերության
            կողմից:
          </p>

          <p className="title6 delivery-titles">
            <span>6. Պատվիրված ապրանքի վերադարձ կամ փոխանակում</span>
          </p>

          <p>
            6.1.Եթե Ձեր գնած ապրանքը չի կրել որակական և քանակային
            փոփոխություններ, կարող եք վերադարձնել այն 14 օրվա ընթացքում`
            ներկայացնելով ՀԴՄ կտրոնը կամ հաշիվ-ապրանքագիրը՝ բացառությամբ այն
            ապրանքերի, որոնք ՀՀ օրենսդրության համաձայն ենթակա չեն վերադարձի կամ
            փոխանակման:
          </p>

          <p>
            6.2.Այդուհանդերձ, եթե ապրանքը վերադարձնելու Ձեր ցանկությունը
            պայմանավորված է նրա որակական հատկանիշներով, Դուք կարող եք մեր
            առաքիչի օգնությամբ փոխարինել տվյալ ապրանքը մեկ ուրիշով:
          </p>

          <p>
            6.3.Նույնը վերաբերում է նաև այն դեպքերին, երբ Դուք սխալմամբ նույն
            ապրանքախմբին պատկանող, բայց այլ ապրանքանիշի ապրանք եք պատվիրել և
            ցանկանում եք փոխարինել այն Ձեր նախընտրածով: Այսպիսի դեպքերում
            Ձեզանից գանձվում է միայն ապրանքների գների տարբերությունը`
            առկայության դեպքում:
          </p>

          <p className="title7 delivery-titles">
            <span>7. Էլեկտրոնային նամակներ և հաղորդակցություն</span>
          </p>

          <p>
            7.1.Երբ Դուք այցելում եք Կայք կամ մեզ էլ. փոստով նամակ եք ուղարկում,
            Դուք հաղորդակցվում եք մեզ հետ: Մենք Ձեզ հետ հաղորդակցվում ենք`
            էլեկտրոնային նամակներ ուղարկելով կամ Կայքում ծանուցումներ ու
            տեղեկություններ տեղադրելով: Փոխադարձ գործարքները պատշաճ ձևակերպելու
            նպատակով Դուք Ձեր համաձայնությունն եք տալիս` ստանալու մեր
            էլեկտրոնային հաղորդակցությունը:
          </p>

          <p>
            7.2.Supermarket.am-ը իր հաճախորդներին ուղարկում է հետևյալ բնույթի
            էլեկտրոնային նամակներ(emails) ի պատասխան Ձեր նամակների:
          </p>

          <p>
            7.3.Պատվերը հաստատող նամակ, որում ներառված է դրա վերաբերյալ ողջ
            տեղեկությունը, ինչպես նաև պատվերի առաքման կամ չեղարկման վերաբերյալ
            նամակ:
          </p>

          <p>
            7.4.Մեր նորույթների, տարատեսակ ակցիաների և այլնի վերաբերյալ նամակներ
            կստանաք միայն այն դեպքում, եթե բաժանորդագրված եք մեր փոստառաքման
            ծառայությանը:
          </p>

          <p className="title8 delivery-titles">
            <span>8. Կայքի պատասխանատվությունը</span>
          </p>

          <p>
            8.1.Supermarket.am կայքում տրված պատվերը իրենից ներկայացնում է
            Ընկերությանը Ձեր կողմից արված առաջարկ` գնելու և առաքման միջոցով
            ստանալու որևէ ապրանք: Այդ առաջարկը համարվում է ընդունված, եթե Ձեր
            էլ. փոստին մեր կողմից ուղարկվում է պատվերը հաստատող նամակ, որտեղ
            նշված են պատվերի բոլոր մանրամասները: Այդ նամակը համարվում է Կայքի և
            Ձեր միջև կնքված պայմանագիր:
          </p>

          <p>
            8.2.Ապրանքը առաքիչի կողմից մատակարարվելուց հետո Ձեր կողմից այն
            ընդունվելով՝ Դուք հաստատում եք ապրանքի քանակական կամ որակական
            հատկությունների վերաբերյալ Ձեր առարկությունների բացակայության փաստը:
          </p>

          <p>
            8.3.Ընկերությունն ազատվում է պատասխանատվությունից իր ստանձնած
            պարտավորությունները չկատարելու կամ հետաձգված կատարելու համար, եթե դա
            պայմանավորված է մեր վերահսկողությունից դուրս գտնվող պատճառներով:
          </p>
        </div>
      </div>
    </div>
  );
};
